Revit 2027 API
ParameterTypeId.EnergyAnalysisShadeDepth Property
 "Shade Depth": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisShadeDepth { get; }
Public Shared ReadOnly Property EnergyAnalysisShadeDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisShadeDepth {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisShadeDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace